#include <chain/util/name_generator.hpp>
#include <regex>

namespace taiyi { namespace chain {

using std::string;
using std::vector;

static vector<string> s_place_location = {"州", "县", "市", "郡", "乡", "道", "府", "城", "堡", "镇", "村", "庄", "驿", "营", "寨", "山", "峰", "岭", "坪", "崖", "谷", "岗", "洞", "川", "坡", "观", "寺", "宫", "原", "岛", "屿", "渚", "汀", "湾", "港", "渡", "津", "坞", "关", "林", "湖", "潭", "池", "泊", "泽", "河", "海", "江", "水"};

static vector<string> s_place_place = {"景", "葛", "岐", "历", "文", "岷", "涿", "盂", "崂", "申", "莱", "渤", "夷", "羽", "青", "成", "渭", "竹", "浮", "英", "时", "咸", "鲜", "单", "雍", "瀛", "苗", "狄", "炎", "玄", "长", "元", "晋", "越", "燕", "蓟", "安", "定", "虹", "浦", "万", "朔", "兴", "宿", "亳", "池", "宣", "福", "泉", "德", "宁", "景", "吉", "抚", "济", "泰", "聊", "滨", "焦", "鄂", "随", "常", "淮", "惠", "梅", "潮", "柳", "钦", "贺", "琼", "泸", "乐", "眉", "丽", "庆", "夏", "栾", "广", "满", "涿", "雄", "顺", "易", "容", "赤", "丰", "广", "固", "冀", "平", "云", "灵", "潞", "滁", "霸", "应", "洪", "蒲", "交", "岚", "扬", "荆", "凉", "益", "幽", "并", "襄", "永", "辽", "巴", "清", "明", "义", "梁", "信"};

static vector<string> s_place_postfix = {"阴", "阳", "东", "西", "南", "北", "中", "安", "平", "昌", "宁", "庆"};

static vector<string> s_share_strange = {"招摇", "堂庭", "祝余", "宪翼", "陵居", "留牛", "箕尾", "诸毗", "长右", "丹粟", "尧光", "瞿父", "句余", "浮玉", "会稽", "列涂", "仆勾", "咸阴", "荆杞", "区吴", "鹿吴", "蛊雕", "漆吴", "天虞", "瞿如", "丹穴", "发爽", "育遗", "阳夹", "灌湘", "仑者", "南禺", "太华", "符禺", "大时", "嶓冡", "皋涂", "无条", "数斯", "泰冒", "数历", "鹿台", "龙首", "鸟危", "崇吾", "博望", "不周", "蠃母", "长留", "积石", "翼望", "上申", "诸次", "白于", "申首", "中曲", "单狐", "肥遗", "谯明", "涿光", "诸怀", "领胡", "求如", "丹熏", "边春", "单张", "灌题", "潘侯", "浑夕", "狐岐", "诸余", "钩吾", "梁渠", "姑灌", "敦题", "龙侯", "马成", "天池", "王屋", "孟门", "虫尾", "彭毗", "泰头", "发鸠", "题首", "敦与", "维龙", "碣石", "雁门", "卢其", "姑射", "姑逢", "空桑", "诸钩", "中父", "胡射", "宜苏", "犀渠", "蒙木", "帝休", "嘉荣", "马嵬", "敖岸", "熊耳", "鹿蹄", "成侯", "朝歌", "长石", "阳华", "放皋", "婴梁", "宜诸", "仁举", "隅阳", "支离", "瑶碧", "高前", "乐马", "虎首", "丑阳", "结匈", "厌火", "周饶", "祝融", "灭蒙", "奇肱", "柔利", "勾芒", "苍梧", "高柳", "服常", "凤尾", "凤麟", "聚窟", "鲜虞", "义渠", "陆浑"};

static vector<string> s_share_common_dao = {"长生", "玉清", "清微", "元始", "上清", "禹余", "灵宝", "太清", "大赤", "道德", "兜率", "紫微", "太微", "禹余", "洞玄", "大赤", "内景", "混世", "合欢", "极乐", "欢喜", "慈悲", "大品", "真武", "灵宝", "神照", "星枢", "神宝", "禅音", "异相", "巨阙", "玲珑", "罗烟", "如意", "太祖", "罗汉", "大衍", "中孚", "无色", "菩提", "普贤", "莲华", "心意", "静禅", "光相", "达摩", "般若", "涅槃", "灵武", "灵悟", "坐忘", "不念", "百合", "芙蓉", "宝色", "灵枢", "素问", "云环", "玉虚", "归藏", "连山", "奇经", "奇门", "遁甲", "霸王", "守拙", "若愚", "太保", "璇玑", "神机", "昆吾", "金刚", "罗刹", "修罗", "如意", "周天", "轮回", "潇湘", "轩辕", "枯荣", "雌雄", "子母"};

static vector<string> s_share_common_element = {"天罡", "天师", "天府", "天照", "天仙", "天宫", "天雷", "天火", "天宝", "天兵", "天枢", "天魔", "天地", "地煞", "地仙", "地宝", "幽冥", "冥河", "日月", "古仙", "古佛", "火焰", "火元", "神火", "烈火", "青焰", "焰光", "寒冰", "玄冰", "光明", "雷电", "水火", "风雷", "雷火", "风火", "冰火", "晶炎"};

static vector<string> s_share_common_creature = {"金童", "玉女", "帝女", "素女", "星女", "游龙", "蟠龙", "神龙", "天龙", "火龙", "毒龙", "狂龙", "烛龙", "应龙", "龙虎", "老虎", "狮子", "狮吼", "狮啸", "苍狼", "野熊", "仙鹤", "灵鹤", "神龟", "灵龟", "玄龟", "灵鳌", "灵蛇", "金蛇", "灵猴", "灵猿", "仙猿", "灵兔", "飞燕", "麒麟", "凤凰", "孔雀", "鴛鴦", "蝴蝶", "螳螂", "天蝉", "燕子", "青龙", "白虎", "朱雀"};

static vector<string> s_share_common_thing = {"紫云", "紫霄", "紫府", "黄泉", "黄竹", "金阙", "金玉", "金身", "金砂", "青莲", "青竹", "青花", "白云", "白虹", "白玉", "白眉", "朱砂", "玄武", "玄门", "玄女", "玄天", "玄都", "黑木", "黑石", "风雨", "花雨", "烟雨", "霹雳", "幻梦", "灵丹", "莲花", "梅花", "琼花", "梨花", "桃花", "飞云", "柔云", "青云", "彩云", "阴风", "寒风", "罡风", "流星", "长风", "长春", "昇阳", "残魂", "残虹"};

static vector<string> s_share_common_color = {"素心", "素银", "紫霞", "素光", "金霞", "金光", "赤霄", "玄阴", "玄冥", "玄微", "青面"};

static vector<string> s_share_common_place = {"少林", "武当", "峨眉", "昆仑", "崆峒", "点苍", "终南", "武夷", "哀牢", "太行", "华山", "泰山", "嵩山", "天山", "衡山", "恒山", "须弥", "蓬莱", "东海", "东华", "南海", "南华", "南斗", "西海", "西域", "北海", "北斗"};

static vector<string> s_share_common_adj = {"通天", "通臂", "通身", "一字", "大力", "迷踪", "沛然", "清净", "逍遥", "缥缈"};

static vector<string> s_share_common_number = {"无常", "无相", "无量", "无极", "无上", "无形", "无影", "无妄", "无定", "无踪", "无为", "无涯", "无终", "无根", "虚空", "空冥", "先天", "希夷", "混沌", "混天", "混元", "浑元", "大荒", "大成", "太极", "太元", "太乙", "太一", "太初", "太始", "太玄", "正气", "朝元", "归元", "归一", "一元", "一气", "一阳", "阴阳", "紫阳", "太阳", "纯阳", "少阳", "太阴", "纯阴", "少阴", "寒阴", "二气", "两仪", "两界", "三清", "三昧", "三生", "三世", "三才", "三元", "三危", "三尸", "四方", "四海", "四象", "五行", "五光", "五气", "五色", "五彩", "五火", "五龙", "五阴", "五阳", "五花", "五鬼", "五毒", "五雷", "六合", "六弦", "六阴", "六阳", "六丁", "六甲", "六虚", "七星", "七宝", "七彩", "七香", "七巧", "七弦", "七杀", "七煞", "八卦", "八门", "八方", "八级", "八目", "八脉", "九龙", "九天", "九转", "九阴", "九阳", "九幽", "九宫", "九炼", "九华", "九鼎", "九曜", "九曲", "十方", "百花", "百灵", "百毒", "百魔", "百仙", "百里", "百丈", "百兽", "百鬼", "百炼", "千机", "千钧", "千里", "万花", "万剑", "万刃", "万仙", "万魂", "万里"};

static vector<string> s_share_common_gesture = {"别离", "离别", "开阖", "离合", "穿梭", "纵横", "来去", "连环", "参合"};

static vector<string> s_share_common_action = {"抱元", "守一", "炼气", "筑基", "结丹", "分神", "合体", "炼虚", "洞真", "洞虚", "凌虚", "易筋", "洗髓", "养志", "散势", "照神", "照天", "照妖", "降魔", "驱魔", "荡魔", "度难", "度厄", "辟邪", "灭神", "灭魔", "伏虎", "吞象", "吞星", "吸星", "移星", "摘星", "问天", "拂云", "浮光", "浮花", "分花", "掠影", "化影", "游身", "拂柳", "凌云", "飞渡", "追风", "扫霞", "听雨", "听雪", "踏雪", "寻梅", "葬花", "望月", "掷灵", "缠丝", "扫尘", "离尘", "御风", "乘风", "弄雾", "兴云", "消冰", "陨玉", "碎玉", "斩铁", "控鹤", "定海", "定风", "定慧", "定影", "开碑", "开弓", "开天", "开山", "劈地", "震岳", "震山", "担山", "架海", "养气", "摧心", "炼血", "化血", "化骨", "化脉", "化煞", "化功", "落阳", "离梦","绝情", "问情", "诛佛", "戮佛", "困佛", "泣灵", "化灵", "叱灵", "斩妖", "诛妖", "戮妖", "困妖", "锁妖", "还魂", "化魂", "落魂", "噬魂", "失魂", "追魂", "断魂", "摄魂", "勾魂", "戮魂", "锁魂", "封魂", "养魂", "荡魔", "镇魔", "伏魔", "诛魔", "戮魔", "困魔", "绝魔", "锁魔", "封魔", "养魔", "护魔", "守魔", "伏天", "诛天", "戮天", "困天", "绝天", "锁天", "封天", "养天", "护天", "守天", "伏神", "诛神", "戮神", "困神", "绝神", "锁神", "封神", "养神", "护神", "守神", "迷仙", "伏仙", "诛仙", "戮仙", "困仙", "绝仙", "锁仙", "封仙", "养仙", "护仙", "守仙", "擒龙", "乘龙", "御龙", "降龙", "伏龙", "诛龙", "戮龙", "困龙", "绝龙", "锁龙", "封龙", "养龙", "护龙", "守龙"};

static vector<string> s_share_common;
void s_init_share_common() {
    if(s_share_common.empty()) {
        s_share_common.insert(s_share_common.end(), s_share_common_dao.begin(), s_share_common_dao.end());
        s_share_common.insert(s_share_common.end(), s_share_common_element.begin(), s_share_common_element.end());
        s_share_common.insert(s_share_common.end(), s_share_common_creature.begin(), s_share_common_creature.end());
        s_share_common.insert(s_share_common.end(), s_share_common_thing.begin(), s_share_common_thing.end());
        s_share_common.insert(s_share_common.end(), s_share_common_color.begin(), s_share_common_color.end());
        s_share_common.insert(s_share_common.end(), s_share_common_place.begin(), s_share_common_place.end());
        s_share_common.insert(s_share_common.end(), s_share_common_adj.begin(), s_share_common_adj.end());
        s_share_common.insert(s_share_common.end(), s_share_common_number.begin(), s_share_common_number.end());
        s_share_common.insert(s_share_common.end(), s_share_common_gesture.begin(), s_share_common_gesture.end());
        s_share_common.insert(s_share_common.end(), s_share_common_action.begin(), s_share_common_action.end());
    }
};

static vector<string> s_name_family = {"李", "王", "张", "刘", "陈", "杨", "赵", "黄", "周", "吴", "徐", "孙", "胡", "朱", "高", "林", "何", "郭", "马", "罗", "梁", "宋", "郑", "谢", "韩", "唐", "冯", "于", "董", "萧", "程", "曹", "袁", "邓", "许", "傅", "沈", "曾", "彭", "吕", "苏", "卢", "蒋", "蔡", "贾", "丁", "魏", "薛", "叶", "阎", "余", "潘", "杜", "戴", "夏", "锺", "汪", "田", "任", "姜", "范", "方", "石", "姚", "谭", "廖", "邹", "熊", "金", "陆", "郝", "孔", "白", "崔", "康", "毛", "邱", "欧阳", "秦", "江", "史", "顾", "侯", "邵", "南宫", "孟", "龙", "万", "段", "漕", "钱", "汤", "尹", "东方", "黎", "易", "常", "武", "乔", "贺", "赖", "龚", "文", "庞", "樊", "兰", "西门", "殷", "施", "陶", "洪", "翟", "安", "令狐", "颜", "倪", "严", "牛", "温", "季", "俞", "章", "鲁", "葛", "伍", "百里", "韦", "申", "尤", "毕", "聂", "焦", "向", "上官", "柳", "邢", "路", "岳", "夏侯", "齐", "梅", "莫", "庄", "辛", "长孙", "管", "祝", "涂", "皇甫", "谷", "祁", "耿", "路", "慕容", "詹", "关", "苗", "凌", "费", "纪", "童", "欧", "甄", "诸葛", "项", "曲", "裴", "席", "查", "屈", "鲍", "霍", "澹台", "柯", "阮", "闵", "解", "柴", "吉", "瞿", "戚", "司徒", "米", "池", "姬", "轩辕", "晏", "栾", "商", "敖", "冷", "司马", "花", "艾", "蓝", "都", "司空", "仲", "乐", "封", "楚", "蔺", "端木", "墨", "宁"};

static vector<string> s_name_female = {"兮", "芳", "星", "清", "夏", "月", "初", "书", "简", "雪", "益", "纯", "琛", "馨", "宁", "吉", "柔", "心", "婉", "昭", "文", "嘉", "微", "秋", "声", "桐", "颜", "杭", "洲", "笑", "语", "新", "佩", "卓", "伊", "云", "洁", "宛", "田", "惠", "瑜", "瑾", "萌", "礼", "佳", "夕", "灼", "华", "彤", "美", "盈", "媛", "奕", "依", "林", "艾", "君", "景", "舟", "楚", "英", "卉", "雨", "瑶", "舒", "恬", "温", "怡", "曼", "斯", "言", "湘", "灵", "琼", "钟", "柯", "康", "昊", "蔚", "兰", "莹", "重", "臻", "素", "菲", "琴", "远", "南", "念", "荷", "献", "晨", "京", "冬", "斐", "禾", "静", "畅", "的", "亿", "薇", "锦", "靖", "白", "慧", "楠", "敏", "卿", "音", "竞", "中", "芮", "鸿", "羽", "愉", "驰", "攸", "悠", "涵", "蓉", "淇", "彦", "姬", "紫", "霜", "偲", "娟", "娜", "媚", "彩", "桃", "姣", "宝", "娇", "春", "露", "棋", "巧", "嫔", "菱", "晗", "妍", "妙", "香", "娴", "姝", "雅", "琪", "姗", "仪", "源", "芷", "芹", "谷", "晴", "珍", "婷", "寻", "妩", "旋", "菡", "颖", "娅", "筠", "妮", "沛", "芙", "婕", "贻", "萱", "赫", "凝", "容", "莲", "玉", "俞", "情", "娈", "姿", "柳", "希", "岚", "蝶", "盼", "玲", "娆", "婵", "海", "幻", "晓", "婧", "丹", "娉", "妃", "冰", "凡", "听", "寒", "旭", "翠", "烟", "倩", "伶", "丽", "萍", "蓝", "瑷", "珊", "代", "蕾", "俪", "梓", "怜", "雯", "琳", "璎", "霏", "霖", "瑞", "嫣", "妤", "画", "含", "慕", "蕊", "嫱", "枫", "雁", "蓓", "纨", "眉", "菁", "苑", "瑗", "琰", "淑", "珠", "芝", "红", "娥", "芬", "燕", "菊", "凤", "梅", "真", "环", "荣", "爱", "妹", "霞", "莺", "艳", "勤", "贞", "莉", "桂", "娣", "叶", "璧", "璐", "琦", "晶", "茜", "莎", "黛", "青", "韵", "融", "园", "艺", "咏", "聪", "澜", "毓", "悦", "爽", "琬", "茗", "欣", "飘", "育", "滢", "馥", "竹", "霭", "欢", "霄", "芸", "亚", "影", "荔", "枝", "秀", "抒", "轩", "睿", "懿", "凌", "翊", "茹", "嫦", "逸", "潍", "滔", "泊", "会", "研", "阳", "森", "弘", "昱", "世", "灏", "沁", "锘", "锐", "鑫", "宇", "贤", "玥", "泽", "镒", "橙", "蕙", "滟", "柄", "铭", "双", "燨", "芊", "壬", "岩", "煦", "筱", "茵", "辰", "弈", "格", "瑛", "珺", "亭", "泉", "尹", "优", "杨", "垣", "葶", "贝", "栩", "芯", "禹", "冉", "漫", "童", "麒", "澄", "苏", "葛", "珂", "尚", "豫", "溪", "齐", "喻", "皖", "曦", "闵", "丞", "孝", "绮", "诗", "殷", "婼", "虹", "翌", "曜", "萧", "唤", "缨", "诺", "金", "皎", "蓁", "飞", "慎", "炜", "洵", "邦", "芃", "绿", "琇", "琚", "陶", "玖", "好", "舜", "德", "零", "猗", "衣", "苓", "湄", "渥", "窈", "荟", "翕", "绥", "令", "闻", "天", "骏", "翰", "溱", "苾", "桢", "缉", "熙", "鹰", "瓒", "徽", "穆", "哲", "秉", "振", "鹭", "铃"};

static vector<string> s_name_male = {"国", "民", "邦", "杰", "宝", "森", "炳", "文", "伯", "华", "龙", "伦", "阳", "博", "常", "春", "栋", "凤", "贵", "俊", "德", "章", "恩", "芳", "业", "志", "光", "泽", "昌", "川", "方", "奎", "亮", "明", "年", "鹏", "全", "顺", "同", "武", "治", "智", "忠", "壮", "道", "清", "兴", "远", "诚", "辉", "良", "林", "隆", "敏", "仁", "荣", "容", "润", "生", "威", "祥", "新", "馨", "秀", "义", "玉", "源", "政", "中", "云", "定", "东", "彩", "鸣", "翔", "仪", "福", "海", "前", "宇", "裕", "桂", "芬", "宾", "均", "卿", "瑞", "泰", "贤", "彦", "英", "珍", "汉", "浩", "河", "鹤", "弘", "毅", "鸿", "儒", "焕", "吉", "济", "先", "嘉", "景", "山", "星", "刚", "俭", "勤", "来", "兰", "言", "利", "臣", "金", "凌", "茂", "孟", "麟", "学", "哲", "南", "培", "基", "沛", "霖", "程", "举", "霄", "启", "起", "千", "里", "松", "谷", "尚", "微", "绍", "时", "雨", "达", "奇", "伟", "世", "科", "禄", "美", "铭", "宁", "雄", "勋", "仕", "淑", "树", "聪", "齐", "睿", "四", "天", "保", "祺", "麒", "廷", "庭", "彬", "斌", "灿", "鼎", "富", "广", "翰", "瀚", "虎", "会", "惠", "锦", "魁", "澜", "礼", "升", "胜", "盛", "通", "炜", "蔚", "熙", "信", "选", "雅", "耀", "烨", "友", "煜", "渊", "昭", "照", "希", "锡", "显", "宪", "孝", "飞", "康", "贞", "恒", "书", "堂", "凯", "跃", "路", "运", "庚", "兆", "丰", "振", "声", "震", "昂", "高", "致", "仲", "谦", "真", "江", "寒", "轩", "宣", "竹", "苑", "权", "琛", "晋", "衡", "昱", "航", "辰", "昊", "旭", "季", "丞", "锋", "濯", "玮", "皓", "炎", "温", "煊", "柯", "恺", "靖", "瑜", "宏", "衿", "卓", "洺", "艺", "晨", "晖", "洋", "歌", "修", "君", "玄", "仙", "毛", "问", "菱", "官", "稷", "邺", "洁", "岚", "乾", "游", "陆", "晓", "墨", "殿", "晏", "佑", "圭", "沅", "楚", "梓", "坤", "拓", "苗", "鹭", "霆", "茗", "黎", "洲", "伊", "冷", "然", "宥", "韬", "陌", "旋", "予", "展", "宸", "司", "暮", "迅", "朔", "驹", "羽", "侗", "圣", "风", "深", "祁", "靳", "翌", "枫", "炫", "瑾", "叶", "赫", "厚", "擎", "翊", "夜", "倾", "淮", "简", "朴", "桦", "健", "裴", "汜", "捷", "幕", "珏", "木", "钧", "默", "顾", "洛", "初", "弦", "络", "昕", "野", "骞", "庸", "能", "骐", "骥", "峻", "曼", "舒", "离", "珵", "旗", "锵", "倡", "灵", "杜", "波", "既", "翾", "青", "勇", "坚", "璐", "秉", "翼", "遥", "休", "尤", "琬", "琰", "冬", "衍", "绎", "心", "怿", "幼", "静", "闲", "嫮", "理", "慈", "逾", "依", "斐", "月", "奋", "素", "菀", "璋", "硕"};

static vector<string> s_name_middle = {"之", "亦", "其", "如", "而", "何", "乃", "且", "若", "和", "所", "为", "也", "以", "因", "于", "与", "则", "之", "尔", "化", "从", "可", "在", "再", "然", "已", "大", "不", "弃", "自", "准", "岂", "才", "仅", "今", "非", "公", "允", "又", "有", "由", "必", "竟", "予", "充", "少", "宜", "更", "复", "者", "客", "安", "成", "承", "崇", "继", "进", "敬", "克", "立", "士", "知", "维", "唯", "采", "易", "扬", "思", "望", "乐", "忆", "一", "元", "长", "正", "子", "宗", "朝", "怀", "无", "建", "梦", "庆", "万", "向", "延", "应", "永", "飞", "广", "垂", "振", "兴", "照", "行", "羡", "摇", "凝", "笑", "融", "听", "忍", "游", "潜", "眠", "念", "近", "献", "留", "寻", "展", "入", "恨", "染", "谈", "追", "惜", "容", "生", "落", "凌", "修", "依", "含", "咏", "学"};
//=============================================================================
string g_generate_location_name(uint32_t rarity, uint32_t random_seed, const string& kind) {
    s_init_share_common();
    
    string name = "";
    
    if(rarity < RARITY_VALUE_RARE) {
        name = s_share_strange[hasher::hash(random_seed) % s_share_strange.size()];
    }
    else if(rarity < RARITY_VALUE_UNCOMMON) {
        name = s_share_common[hasher::hash(random_seed) % s_share_common.size()];
    }
    else {
        name = s_place_place[hasher::hash(random_seed) % s_place_place.size()];
        if((hasher::hash(random_seed + 6857) % 1000) < RARITY_VALUE_UNCOMMON)
            name += s_place_postfix[hasher::hash(random_seed + 2) % s_place_postfix.size()];
    }
    
    if(kind == "")
        return name + s_place_location[hasher::hash(random_seed + 3) % s_place_location.size()];
    else
        return name + kind;
}
//=============================================================================
string g_generate_actor_name(uint32_t random_seed, string& familyName, string& middleCharacter, string& lastCharacter, int& gender, int& style)
{
    if(familyName == "") familyName = s_name_family[hasher::hash(random_seed + 14737) % s_name_family.size()];
    if(gender == 0) gender = (hasher::hash(random_seed + 14923) % 2 == 0) ? -1 : 1; //-1=male, 1=female
    vector<string>* namesOfASex = gender == -1 ? &s_name_male : &s_name_female;
    if(style == 0) {
        uint32_t r = hasher::hash(random_seed + 15193) % 100000000;
        style = r < 33333333 ? 1 : r < 66666666 ? 2 : 3; //1=single, 2=double, 3=combine
    }
    
    string name = "";
    if(style == 1) {
        if (middleCharacter == "") middleCharacter = (*namesOfASex)[hasher::hash(random_seed + 3) % namesOfASex->size()];
        name = middleCharacter;
        lastCharacter = "";
    }
    else if(style == 2) {
        if (middleCharacter == "") middleCharacter = (*namesOfASex)[hasher::hash(random_seed + 3) % namesOfASex->size()];
        if (lastCharacter == "") lastCharacter = (*namesOfASex)[hasher::hash(random_seed + 4) % namesOfASex->size()];
        name = middleCharacter + lastCharacter;
    }
    else {
        if (middleCharacter == "") middleCharacter = s_name_middle[hasher::hash(random_seed + 3) % s_name_middle.size()];
        if (lastCharacter == "") lastCharacter = (*namesOfASex)[hasher::hash(random_seed + 4) % namesOfASex->size()];
        name = middleCharacter + lastCharacter;
    }
    return familyName + name;
}

} } // namespace taiyi::chain
